benchmark/output-level-1.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /pub
Document Length:        2 bytes

Concurrency Level:      10
Time taken for tests:   0.200 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      118000 bytes
Total body sent:        190000
HTML transferred:       2000 bytes
Requests per second:    4989.97 [#/sec] (mean)
Time per request:       2.004 [ms] (mean)
Time per request:       0.200 [ms] (mean, across all concurrent requests)
Transfer rate:          575.02 [Kbytes/sec] received
                        925.87 kb/s sent
                        1500.89 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      0       6
Processing:     0    1   2.5      1      31
Waiting:        0    1   2.5      1      31
Total:          0    2   2.7      1      32
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      2
  80%      2
  90%      3
  95%      6
  98%      9
  99%     22
 100%     32 (longest request)